While we're waiting on the review, I'll just post the proof that we're not running afoul of iterating/counting on computed values:
# test.tf
```hcl
module test_topic {
  source = "../."
  name   = "TEMPORARYTESTTOPIC"
  # allow_publish_aws_services = ["cloudwatch.amazonaws.com"]
  # allow_publish_iam_arns = ["arn:aws:iam::XXXXXXXXXXXX:role/DeveloperRole"]
  allow_publish_iam_arns = [for o in aws_iam_role.roles : o.arn]
  # policy                     = <<EOT
  # {
  #   "Version": "2012-10-17",
  #   "Statement": [
  #     {
  #       "Sid": "",
  #       "Effect": "Allow",
  #       "Principal": {
  #         "AWS": "arn:aws:iam::XXXXXXXXXXXX:role/DeveloperRole",
  #         "Service": "sqs.amazonaws.com"
  #       },
  #       "Action": "sns:Publish",
  #       "Resource": "*"
  #     }
  #   ]
  # }
  # EOT
}

resource aws_iam_role roles {
  for_each           = toset(["TESTROLE1", "TESTROLE2"])
  name               = each.value
  assume_role_policy = <<EOF
    {
      "Version": "2012-10-17",
      "Statement": [
        {
          "Action": "sts:AssumeRole",
          "Principal": {
            "Service": "ec2.amazonaws.com"
          },
          "Effect": "Allow",
          "Sid": ""
        }
      ]
    }
    EOF
}
```

# terraform plan output
```bash
$ terraform plan
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.


------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # aws_iam_role.roles["TESTROLE1"] will be created
  + resource "aws_iam_role" "roles" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "TESTROLE1"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # aws_iam_role.roles["TESTROLE2"] will be created
  + resource "aws_iam_role" "roles" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "TESTROLE2"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # module.test_topic.data.aws_iam_policy_document.this will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "sns:Publish",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]

          + principals {
              + identifiers = [
                  + (known after apply),
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
    }

  # module.test_topic.aws_sns_topic.this[0] will be created
  + resource "aws_sns_topic" "this" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + name   = "TEMPORARYTESTTOPIC"
      + policy = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.
```